mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
				</field>
			</fields>
		</register>
		<register>
			<name>TC</name>
			<description>Timer Counter. The 32 bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TC</name>
					<description>Timer counter value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PR</name>
			<description>Prescale Register. Determines how often the PWM counter is incremented.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PM</name>
					<description>Prescale counter maximum value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PC</name>
			<description>Prescale Counter. Prescaler for the main PWM counter.</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PC</name>
					<description>Prescale counter value.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MCR</name>
			<description>Match Control Register. The MCR is used to control whether an interrupt is generated and if the PWM counter is reset when a Match occurs.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PWMMR0I</name>
					<description>Interrupt PWM0</description>
					<bitRange>[0:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERRUPT_ON_PWMMR0</name>
							<description>Interrupt on PWMMR0: an interrupt is generated when PWMMR0 matches the value in the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR0R</name>
					<description>Reset PWM0</description>
					<bitRange>[1:1]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_ON_PWMMR0_THE</name>
							<description>Reset on PWMMR0: the PWMTC will be reset if PWMMR0 matches it.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR0S</name>
					<description>Stop PWM0</description>
					<bitRange>[2:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STOP_ON_PWMMR0_THE_</name>
							<description>Stop on PWMMR0: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR0 matches the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR1I</name>
					<description>Interrupt PWM1</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERRUPT_ON_PWMMR1</name>
							<description>Interrupt on PWMMR1: an interrupt is generated when PWMMR1 matches the value in the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR1R</name>
					<description>Reset PWM1</description>
					<bitRange>[4:4]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_ON_PWMMR1_THE</name>
							<description>Reset on PWMMR1: the PWMTC will be reset if PWMMR1 matches it.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR1S</name>
					<description>Stop PWM1</description>
					<bitRange>[5:5]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STOP_ON_PWMMR1_THE_</name>
							<description>Stop on PWMMR1: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR1 matches the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR2I</name>
					<description>Interrupt PWM0</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERRUPT_ON_PWMMR2</name>
							<description>Interrupt on PWMMR2: an interrupt is generated when PWMMR2 matches the value in the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR2R</name>
					<description>Reset PWM0</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_ON_PWMMR2_THE</name>
							<description>Reset on PWMMR2: the PWMTC will be reset if PWMMR2 matches it.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR2S</name>
					<description>Stop PWM0</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STOP_ON_PWMMR2_THE_</name>
							<description>Stop on PWMMR2: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR0 matches the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR3I</name>
					<description>Interrupt PWM3</description>
					<bitRange>[9:9]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERRUPT_ON_PWMMR3</name>
							<description>Interrupt on PWMMR3: an interrupt is generated when PWMMR3 matches the value in the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR3R</name>
					<description>Reset PWM3</description>
					<bitRange>[10:10]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_ON_PWMMR3_THE</name>
							<description>Reset on PWMMR3: the PWMTC will be reset if PWMMR3 matches it.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR3S</name>
					<description>Stop PWM0</description>
					<bitRange>[11:11]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STOP_ON_PWMMR3_THE_</name>
							<description>Stop on PWMMR3: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR0 matches the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR4I</name>
					<description>Interrupt PWM4</description>
					<bitRange>[12:12]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERRUPT_ON_PWMMR4</name>
							<description>Interrupt on PWMMR4: an interrupt is generated when PWMMR4 matches the value in the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR4R</name>
					<description>Reset PWM4</description>
					<bitRange>[13:13]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_ON_PWMMR4_THE</name>
							<description>Reset on PWMMR4: the PWMTC will be reset if PWMMR4 matches it.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR4S</name>
					<description>Stop PWM4</description>
					<bitRange>[14:14]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STOP_ON_PWMMR4_THE_</name>
							<description>Stop on PWMMR4: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR4 matches the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR5I</name>
					<description>Interrupt PWM5</description>
					<bitRange>[15:15]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERRUPT_ON_PWMMR5</name>
							<description>Interrupt on PWMMR5: an interrupt is generated when PWMMR5 matches the value in the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR5R</name>
					<description>Reset PWM5</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_ON_PWMMR5_THE</name>
							<description>Reset on PWMMR5: the PWMTC will be reset if PWMMR5 matches it.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR5S</name>
					<description>Stop PWM5</description>
					<bitRange>[17:17]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STOP_ON_PWMMR5_THE_</name>
							<description>Stop on PWMMR5: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR5 matches the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR6I</name>
					<description>Interrupt PWM6</description>
					<bitRange>[18:18]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>INTERRUPT_ON_PWMMR6</name>
							<description>Interrupt on PWMMR6: an interrupt is generated when PWMMR6 matches the value in the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR6R</name>
					<description>Reset PWM6</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_</name>
							<description>Disabled.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RESET_ON_PWMMR6_THE</name>
							<description>Reset on PWMMR6: the PWMTC will be reset if PWMMR6 matches it.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PWMMR6S</name>
					<description>Stop PWM6</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED</name>
							<description>Disabled</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>STOP_ON_PWMMR6_THE_</name>
							<description>Stop on PWMMR6: the PWMTC and PWMPC will be stopped and PWMTCR bit 0 will be set to 0 if PWMMR6 matches the PWMTC.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:21]</bitRange>

