mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
				</field>							
				<field>							
					<name>PWMENA1</name>						
					<description>PWM[1] output enable control.</description>						
					<bitRange>[9:9]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_DI</name>				
							<description>The PWM output is disabled.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_EN</name>				
							<description>The PWM output is enabled.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMENA2</name>						
					<description>PWM[2] output enable control.</description>						
					<bitRange>[10:10]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_DI</name>				
							<description>The PWM output is disabled.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_EN</name>				
							<description>The PWM output is enabled.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMENA3</name>						
					<description>PWM[3] output enable control.</description>						
					<bitRange>[11:11]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_DI</name>				
							<description>The PWM output is disabled.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_EN</name>				
							<description>The PWM output is enabled.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMENA4</name>						
					<description>PWM[4] output enable control.</description>						
					<bitRange>[12:12]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_DI</name>				
							<description>The PWM output is disabled.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_EN</name>				
							<description>The PWM output is enabled.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMENA5</name>						
					<description>PWM[5] output enable control.</description>						
					<bitRange>[13:13]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_DI</name>				
							<description>The PWM output is disabled.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_EN</name>				
							<description>The PWM output is enabled.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>PWMENA6</name>						
					<description>PWM[6] output enable control. See PWMENA1 for details.</description>						
					<bitRange>[14:14]</bitRange>						
					<enumeratedValues>						
						<name>ENUM</name>						
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_DI</name>				
							<description>The PWM output is disabled.</description>				
							<value>0</value>				
						</enumeratedValue>					
						<enumeratedValue>					
							<name>THE_PWM_OUTPUT_IS_EN</name>				
							<description>The PWM output is enabled.</description>				
							<value>1</value>				
						</enumeratedValue>					
					</enumeratedValues>						
				</field>							
				<field>							
					<name>RESERVED</name>						
					<description>Unused, always zero.</description>						
					<bitRange>[31:15]</bitRange>						
											
				</field>							
			</fields>								
		</register>									
		

		
		<register>
			<name>LER</name>
			<description>Load Enable Register. Enables use of updated PWM match values.</description>
			<addressOffset>0x050</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MAT0LATCHEN</name>
					<description>Enable PWM Match 0 Latch. PWM MR0 register update control. Writing a one to this bit allows the last value written to the PWM Match Register 0 to be become effective when the timer is next reset by a PWM Match event. See Section 27.6.7.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>MAT1LATCHEN</name>
					<description>Enable PWM Match 1 Latch. PWM MR1 register update control. See bit 0 for details.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>MAT2LATCHEN</name>
					<description>Enable PWM Match 2 Latch. PWM MR2 register update control. See bit 0 for details.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MAT3LATCHEN</name>
					<description>Enable PWM Match 3 Latch. PWM MR3 register update control. See bit 0 for details.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>MAT4LATCHEN</name>
					<description>Enable PWM Match 4 Latch. PWM MR4 register update control. See bit 0 for details.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>MAT5LATCHEN</name>
					<description>Enable PWM Match 5 Latch. PWM MR5 register update control. See bit 0 for details.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>MAT6LATCHEN</name>
					<description>Enable PWM Match 6 Latch. PWM MR6 register update control. See bit 0 for details.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:7]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CTCR</name>
			<description>Count Control Register. The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting.</description>
			<addressOffset>0x070</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MOD</name>
					<description>Counter/  Timer Mode</description>
					<bitRange>[1:0]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>TIMER_MODE_THE_TC_I</name>
							<description>Timer Mode: the TC is incremented when the Prescale Counter matches the Prescale register.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING_EDGE_COUNTER_</name>
							<description>Rising edge counter Mode: the TC is incremented on rising edges of the PWM_CAP input selected by bits 3:2.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>FALLING_EDGE_COUNTER</name>
							<description>Falling edge counter Mode: the TC is incremented on falling edges of the PWM_CAP input selected by bits 3:2.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>DUAL_EDGE_COUNTER_MO</name>
							<description>Dual edge counter Mode: the TC is incremented on both edges of the PWM_CAP input selected by bits 3:2.</description>
							<value>0x3</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CIS</name>
					<description>Count Input Select. When bits 1:0 are not 00, these bits select which PWM_CAP pin carries the signal used to increment the TC. Other combinations are reserved.</description>
					<bitRange>[3:2]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FOR_PWM0_00_EQ_PWM0_</name>
							<description>For PWM0: 00 = PWM0_CAP0 (Other combinations are reserved) For PWM1: 00 = PWM1_CAP0, 01 = PWM1_CAP1 (Other combinations are reserved)</description>
							<value>0x0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:4]</bitRange>

