mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
			</field>																
			<field>																
				<name>P0_15</name>															
				<description>Pin function select P0.15.</description>															
				<bitRange>[31:30]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.15</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>TXD1</name>													
						<description>TXD1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SCK0</name>													
						<description>SCK0</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SCK</name>													
						<description>SCK</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINSEL1</name>																	
		<description>Pin function select register 1.</description>																	
		<addressOffset>0x004</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>P0_16</name>															
				<description>Pin function select P0.16.</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.16</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RXD1</name>													
						<description>RXD1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SSEL0</name>													
						<description>SSEL0</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SSEL</name>													
						<description>SSEL</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_17</name>															
				<description>Pin function select P0.17.</description>															
				<bitRange>[3:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.17</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CTS1</name>													
						<description>CTS1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MISO0</name>													
						<description>MISO0</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MISO</name>													
						<description>MISO</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_18</name>															
				<description>Pin function select P0.18.</description>															
				<bitRange>[5:4]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.18</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DCD1</name>													
						<description>DCD1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MOSI0</name>													
						<description>MOSI0</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MOSI</name>													
						<description>MOSI</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_19</name>															
				<description>Pin function select P019.</description>															
				<bitRange>[7:6]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.19.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DSR1</name>													
						<description>DSR1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SDA1</name>													
						<description>SDA1</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_20</name>															
				<description>Pin function select P0.20.</description>															
				<bitRange>[9:8]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.20.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DTR1</name>													
						<description>DTR1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SCL1</name>													
						<description>SCL1</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_21</name>															
				<description>Pin function select P0.21.</description>															
				<bitRange>[11:10]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_PORT_0</name>													
						<description>GPIO Port 0.21.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RI1</name>													
						<description>RI1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RD1</name>													
						<description>RD1</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_22</name>															
				<description>Pin function select P022</description>															
				<bitRange>[13:12]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.22.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RTS1</name>													
						<description>RTS1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>TD1</name>													
						<description>TD1</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_23</name>															
				<description>Pin function select P023.</description>															
				<bitRange>[15:14]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.23.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>AD0</name>													
						<description>AD0.0</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>I2SRX_CLK</name>													
						<description>I2SRX_CLK</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAP3</name>													
						<description>CAP3.0</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_24</name>															
				<description>Pin function select P0.24.</description>															
				<bitRange>[17:16]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.24.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>AD0</name>													
						<description>AD0.1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>I2SRX_WS</name>													
						<description>I2SRX_WS</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CAP3</name>													
						<description>CAP3.1</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_25</name>															
				<description>Pin function select P0.25.</description>															
				<bitRange>[19:18]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.25</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>AD0</name>													
						<description>AD0.2</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>I2SRX_SDA</name>													
						<description>I2SRX_SDA</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>TXD3</name>													
						<description>TXD3</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_26</name>															
				<description>Pin function select P0.26.</description>															
				<bitRange>[21:20]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.26</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>AD0</name>													
						<description>AD0.3</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>AOUT</name>													
						<description>AOUT</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RXD3</name>													
						<description>RXD3</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_27</name>															
				<description>Pin function select P0.27.</description>															
				<bitRange>[23:22]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.27</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SDA0</name>													
						<description>SDA0</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>USB_SDA</name>													
						<description>USB_SDA</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_28</name>															
				<description>Pin function select P0.28.</description>															
				<bitRange>[25:24]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.28</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SCL0</name>													
						<description>SCL0</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>USB_SCL</name>													
						<description>USB_SCL</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_29</name>															
				<description>Pin function select P0.29</description>															
				<bitRange>[27:26]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.29</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>USB_DP</name>													
						<description>USB_D+</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P0_30</name>															
				<description>Pin function select P0.30.</description>															
				<bitRange>[29:28]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P0</name>													
						<description>GPIO P0.30</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>USB_DM</name>													
						<description>USB_D-</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[31:30]</bitRange>															
														
