mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINSEL2</name>																	
		<description>Pin function select register 2.</description>																	
		<addressOffset>0x008</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>P1_0</name>															
				<description>Pin function select P1.0.</description>															
				<bitRange>[1:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P1</name>													
						<description>GPIO P1.0</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENET_TXD0</name>													
						<description>ENET_TXD0</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_1</name>															
				<description>Pin function select P1.1.</description>															
				<bitRange>[3:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P1</name>													
						<description>GPIO P1.1</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENET_TXD1</name>													
						<description>ENET_TXD1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[7:4]</bitRange>															
														
			</field>																
			<field>																
				<name>P1_4</name>															
				<description>Pin function select P1.4.</description>															
				<bitRange>[9:8]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P1</name>													
						<description>GPIO P1.4.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENET_TX_EN</name>													
						<description>ENET_TX_EN</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[15:10]</bitRange>															
														
			</field>																
			<field>																
				<name>P1_8</name>															
				<description>Pin function select P1.8.</description>															
				<bitRange>[17:16]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P1</name>													
						<description>GPIO P1.8.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENET_CRS</name>													
						<description>ENET_CRS</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_9</name>															
				<description>Pin function select P1.9.</description>															
				<bitRange>[19:18]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_PORT_1</name>													
						<description>GPIO Port 1.9</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENET_RXD0</name>													
						<description>ENET_RXD0</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P1_10</name>															
				<description>Pin function select P1.10.</description>															
				<bitRange>[21:20]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P1</name>													
						<description>GPIO P1.10</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>ENET_RXD1</name>													
						<description>ENET_RXD1</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[29:24]</bitRange>															
														
