mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINSEL7</name>																	
		<description>Pin function select register 7</description>																	
		<addressOffset>0x01C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[17:0]</bitRange>															
														
			</field>																
			<field>																
				<name>P3_25</name>															
				<description>Pin function select P3.25.</description>															
				<bitRange>[19:18]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P3</name>													
						<description>GPIO P3.25</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RESERVED</name>													
						<description>Reserved</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MAT0</name>													
						<description>MAT0.0</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PWM1</name>													
						<description>PWM1.2</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P3_26</name>															
				<description>Pin function select P3.26.</description>															
				<bitRange>[21:20]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P3</name>													
						<description>GPIO P3.26</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>STCLK</name>													
						<description>STCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MAT0</name>													
						<description>MAT0.1</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PWM1</name>													
						<description>PWM1.3</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:22]</bitRange>															
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINSEL9</name>																	
		<description>Pin function select register 9</description>																	
		<addressOffset>0x024</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[23:0]</bitRange>															
														
			</field>																
			<field>																
				<name>P4_28</name>															
				<description>Pin function select P4.28.</description>															
				<bitRange>[25:24]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P4</name>													
						<description>GPIO P4.28</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RX_MCLK</name>													
						<description>RX_MCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MAT2</name>													
						<description>MAT2.0</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>TXD3</name>													
						<description>TXD3</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P4_29</name>															
				<description>Pin function select P4.29.</description>															
				<bitRange>[27:26]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>GPIO_P4</name>													
						<description>GPIO P4.29</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>TX_MCLK</name>													
						<description>TX_MCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>MAT2</name>													
						<description>MAT2.1</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RXD3</name>													
						<description>RXD3</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:28]</bitRange>															
														
