mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE7</name>																	
		<description>Pin mode select register 7</description>																	
		<addressOffset>0x05C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved</description>															
				<bitRange>[17:0]</bitRange>															
																			
														
			</field>																
			<field>																
				<name>P3_25MODE</name>															
				<description>Port 3 pin 25 control.</description>															
				<bitRange>[19:18]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P3.25 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P3.25 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P3.25 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P3.25 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P3_26MODE</name>															
				<description>Port 3 pin 26 control.</description>															
				<bitRange>[21:20]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P3.26 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P3.26 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P3.26 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P3.26 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:22]</bitRange>															
																			
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE9</name>																	
		<description>Pin mode select register 9</description>																	
		<addressOffset>0x064</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[23:0]</bitRange>															
																			
														
			</field>																
			<field>																
				<name>P4_28MODE</name>															
				<description>Port 4 pin 28 control.</description>															
				<bitRange>[25:24]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P4.28 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P4.28 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P4.28 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P4.28 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P4_29MODE</name>															
				<description>Port 4 pin 29 control.</description>															
				<bitRange>[27:26]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P4.29 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P4.29 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P4.29 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P4.29 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:28]</bitRange>															
																			
														
