mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
				</field>
			</fields>
		</register>
		<register>
			<dim>8</dim>
			<dimIncrement>0x4</dimIncrement>
			<dimIndex>0-7</dimIndex>
			<name>DR[%s]</name>
			<displayName>DR[%s]</displayName>
			<description>A/D Channel 0 Data Register. This register contains the result of the most recent conversion completed on channel 0.</description>
			<addressOffset>0x010</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESULT</name>
					<description>When DONE is 1, this field contains a binary fraction representing the voltage on the AD0[n] pin, as it falls within the range of VREFP to V SS. Zero in the field indicates that the voltage on the input pin was less than, equal to, or close to that on VSS, while 0xFFF indicates that the voltage on the input was close to, equal to, or greater than that on VREFP.</description>
					<bitRange>[15:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[29:16]</bitRange>
				</field>
				<field>
					<name>OVERRUN</name>
					<description>This bit is 1 in burst mode if the results of one or more conversions was (were) lost and overwritten before the conversion that produced the result in the RESULT bits.This bit is cleared by reading this register.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>DONE</name>
					<description>This bit is set to 1 when an A/D conversion completes. It is cleared when this register is read.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STAT</name>
			<description>A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt/DMA flag.</description>
			<addressOffset>0x030</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DONE0</name>
					<description>This bit mirrors the DONE status flag from the result register for A/D channel 0.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>DONE1</name>
					<description>This bit mirrors the DONE status flag from the result register for A/D channel 1.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>DONE2</name>
					<description>This bit mirrors the DONE status flag from the result register for A/D channel 2.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DONE3</name>
					<description>This bit mirrors the DONE status flag from the result register for A/D channel 3.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>DONE4</name>
					<description>This bit mirrors the DONE status flag from the result register for A/D channel 4.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>DONE5</name>
					<description>This bit mirrors the DONE status flag from the result register for A/D channel 5.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>DONE6</name>
					<description>This bit mirrors the DONE status flag from the result register for A/D channel 6.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>DONE7</name>
					<description>This bit mirrors the DONE status flag from the result register for A/D channel 7.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>OVERRUN0</name>
					<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 0.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>OVERRUN1</name>
					<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 1.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>OVERRUN2</name>
					<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 2.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>OVERRUN3</name>
					<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 3.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>OVERRUN4</name>
					<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 4.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>OVERRUN5</name>
					<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 5.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>OVERRUN6</name>
					<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 6.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>OVERRUN7</name>
					<description>This bit mirrors the OVERRRUN status flag from the result register for A/D channel 7.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>ADINT</name>
					<description>This bit is the A/D interrupt flag. It is one when any of the individual A/D channel Done flags is asserted and enabled to contribute to the A/D interrupt via the ADINTEN register.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:17]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TRM</name>
			<description>ADC trim register.</description>
			<addressOffset>0x034</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>ADCOFFS</name>
					<description>Offset trim bits for ADC operation. Initialized by the boot code. Can be overwritten by the user.</description>
					<bitRange>[7:4]</bitRange>
				</field>
				<field>
					<name>TRIM</name>
					<description>written-to by boot code. Can not be overwritten by the user. These bits are locked after boot code write.</description>
					<bitRange>[11:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:12]</bitRange>
				</field>
			</fields>
		</register>
