mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
						</field>
					</fields>
				</register>
				<register>
					<name>COUNTER</name>
					<description>32-bit counter</description>
					<addressOffset>0x00C</addressOffset>
					<access>read-write</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RICOUNTER</name>
							<description>32-bit up counter. Counts continuously unless RITEN bit in RICTRL register is cleared or debug mode is entered (if enabled by the RITNEBR bit in RICTRL). Can be loaded to any value in software.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		
		<peripheral>
			<name>MCPWM</name>
			<description>Motor Control PWM</description>
			<groupName>MCPWM</groupName>
			<baseAddress>0x400B8000</baseAddress>
			<addressBlock>
				<offset>0</offset>
				<size>0xFFF</size>
				<usage>registers</usage>
			</addressBlock>
			<interrupt>
				<name>MCPWM</name>
				<value>30</value>

			</interrupt>
			<registers>
				<register>
					<name>CON</name>
					<description>PWM Control read address</description>
					<addressOffset>0x000</addressOffset>
					<access>read-only</access>
					<resetValue>0</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>RUN0</name>
							<description>Stops/starts timer channel 0.</description>
							<bitRange>[0:0]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STOP_</name>
									<description>Stop.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN_</name>
									<description>Run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CENTER0</name>
							<description>Edge/center aligned operation for channel 0.</description>
							<bitRange>[1:1]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EDGE_ALIGNED_</name>
									<description>Edge-aligned.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER_ALIGNED_</name>
									<description>Center-aligned.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLA0</name>
							<description>Selects polarity of the MCOA0 and MCOB0 pins.</description>
							<bitRange>[2:2]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_LOW</name>
									<description>Passive state is LOW, active state is HIGH.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_HIG</name>
									<description>Passive state is HIGH, active state is LOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE0</name>
							<description>Controls the dead-time feature for channel 0.</description>
							<bitRange>[3:3]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEAD_TIME_DISABLED_</name>
									<description>Dead-time disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEAD_TIME_ENABLED_</name>
									<description>Dead-time enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUP0</name>
							<description>Enable/disable updates of functional registers for channel 0 (see Section 24.8.2).</description>
							<bitRange>[4:4]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>UPDATE</name>
									<description>Functional registers are updated from the write registers at the end of each PWM cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOUPDATE</name>
									<description>Functional registers remain the same as long as the timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[7:5]</bitRange>
							
						</field>
						<field>
							<name>RUN1</name>
							<description>Stops/starts timer channel 1.</description>
							<bitRange>[8:8]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>STOP_</name>
									<description>Stop.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>RUN_</name>
									<description>Run.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CENTER1</name>
							<description>Edge/center aligned operation for channel 1.</description>
							<bitRange>[9:9]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>EDGE_ALIGNED_</name>
									<description>Edge-aligned.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>CENTER_ALIGNED_</name>
									<description>Center-aligned.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>POLA1</name>
							<description>Selects polarity of the MCOA1 and MCOB1 pins.</description>
							<bitRange>[10:10]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_LOW</name>
									<description>Passive state is LOW, active state is HIGH.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>PASSIVE_STATE_IS_HIG</name>
									<description>Passive state is HIGH, active state is LOW.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DTE1</name>
							<description>Controls the dead-time feature for channel 1.</description>
							<bitRange>[11:11]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>DEAD_TIME_DISABLED_</name>
									<description>Dead-time disabled.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>DEAD_TIME_ENABLED_</name>
									<description>Dead-time enabled.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DISUP1</name>
							<description>Enable/disable updates of functional registers for channel 1 (see Section 24.8.2).</description>
							<bitRange>[12:12]</bitRange>
							<enumeratedValues>
								<name>ENUM</name>
								<enumeratedValue>
									<name>UPDATE</name>
									<description>Functional registers are updated from the write registers at the end of each PWM cycle.</description>
									<value>0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>NOUPDATE</name>
									<description>Functional registers remain the same as long as the timer is running.</description>
									<value>1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RESERVED</name>
							<description>Reserved.</description>
							<bitRange>[15:13]</bitRange>
							
