mekatrol/pcb-mill/firmware/cnc/build/LPC176x.svd
				</field>
				<field>
					<name>EPTXINTSET9</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[9:9]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET10</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[10:10]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET11</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[11:11]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET12</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[12:12]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET13</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[13:13]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET14</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[14:14]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET15</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[15:15]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET16</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[16:16]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET17</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[17:17]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET18</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[18:18]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET19</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[19:19]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET20</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[20:20]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET21</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[21:21]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET22</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[22:22]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET23</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[23:23]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET24</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[24:24]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET25</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[25:25]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET26</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[26:26]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET27</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[27:27]</bitRange>
										
				</field>
				<field>
					<name>EPTXINTSET28</name>
					<description>Set endpoint xx (2 &lt;= xx  &lt;= 31) End of Transfer Interrupt request. 0 = No effect. 1 = Set the EPxx End of Transfer Interrupt request in the USBEoTIntSt register.</description>
					<bitRange>[28:28]</bitRange>
										
